// 《周易》六十四卦經文（公有領域原文，資料整理自 open-iching, ISC License）
// lines: 由下而上，1=陽爻 0=陰爻
export interface ZhouyiLine { name: string; text: string }
export interface ZhouyiGua { id: number; name: string; fullName: string; lower: string; upper: string; lines: number[]; guaci: string; yaoci: ZhouyiLine[] }
export const ZHOUYI: ZhouyiGua[] = [
 {
  "id": 1,
  "name": "乾",
  "fullName": "乾為天",
  "lower": "乾",
  "upper": "乾",
  "lines": [
   1,
   1,
   1,
   1,
   1,
   1
  ],
  "guaci": "元亨利貞。",
  "yaoci": [
   {
    "name": "初九",
    "text": "潛龍，勿用。"
   },
   {
    "name": "九二",
    "text": "見龍在田，利見大人。"
   },
   {
    "name": "九三",
    "text": "君子終日乾乾，夕惕若，厲無咎。"
   },
   {
    "name": "九四",
    "text": "或躍在淵，無咎。"
   },
   {
    "name": "九五",
    "text": "飛龍在天，利見大人。"
   },
   {
    "name": "上九",
    "text": "亢龍有悔。"
   },
   {
    "name": "用九",
    "text": "見群龍無首，吉。"
   }
  ]
 },
 {
  "id": 2,
  "name": "坤",
  "fullName": "坤為地",
  "lower": "坤",
  "upper": "坤",
  "lines": [
   0,
   0,
   0,
   0,
   0,
   0
  ],
  "guaci": "元亨，利牝馬之貞。君子有攸往，先迷，後得主，利。西南得朋，東北喪朋。安貞吉。",
  "yaoci": [
   {
    "name": "初六",
    "text": "履霜，堅冰至。"
   },
   {
    "name": "六二",
    "text": "直方大，不習無不利。"
   },
   {
    "name": "六三",
    "text": "含章可貞；或從王事，無成有終。"
   },
   {
    "name": "六四",
    "text": "括囊，無咎無譽。"
   },
   {
    "name": "六五",
    "text": "黃裳，元吉。"
   },
   {
    "name": "上六",
    "text": "龍戰于野，其血玄黃。"
   },
   {
    "name": "用六",
    "text": "利永貞。"
   }
  ]
 },
 {
  "id": 3,
  "name": "屯",
  "fullName": "水雷屯",
  "lower": "震",
  "upper": "坎",
  "lines": [
   1,
   0,
   0,
   0,
   1,
   0
  ],
  "guaci": "元亨，利貞；勿用有攸往，利建侯。",
  "yaoci": [
   {
    "name": "初九",
    "text": "磐桓；利居貞，利建侯。"
   },
   {
    "name": "六二",
    "text": "屯如，邅如，乘馬班如。匪寇婚媾。女子貞不字，十年乃字。"
   },
   {
    "name": "六三",
    "text": "即鹿無虞，惟入于林中，君子幾，不如舍，往吝。"
   },
   {
    "name": "六四",
    "text": "乘馬班如，求婚媾，往吉，無不利。"
   },
   {
    "name": "九五",
    "text": "屯其膏，小貞吉，大貞凶。"
   },
   {
    "name": "上六",
    "text": "乘馬班如，泣血漣如。"
   }
  ]
 },
 {
  "id": 4,
  "name": "蒙",
  "fullName": "山水蒙",
  "lower": "坎",
  "upper": "艮",
  "lines": [
   0,
   1,
   0,
   0,
   0,
   1
  ],
  "guaci": "亨。匪我求童蒙，童蒙求我。初筮告，再三瀆，瀆則不告。利貞。",
  "yaoci": [
   {
    "name": "初六",
    "text": "發矇，利用刑人，用說桎梏；以往吝。"
   },
   {
    "name": "九二",
    "text": "包蒙，吉。納婦，吉；子克家。"
   },
   {
    "name": "六三",
    "text": "勿用取女，見金夫，不有躬，無攸利。"
   },
   {
    "name": "六四",
    "text": "困蒙，吝。"
   },
   {
    "name": "六五",
    "text": "童蒙，吉。"
   },
   {
    "name": "上九",
    "text": "擊蒙；不利為寇，利禦寇。"
   }
  ]
 },
 {
  "id": 5,
  "name": "需",
  "fullName": "水天需",
  "lower": "乾",
  "upper": "坎",
  "lines": [
   1,
   1,
   1,
   0,
   1,
   0
  ],
  "guaci": "有孚，光亨，貞吉，利涉大川。",
  "yaoci": [
   {
    "name": "初九",
    "text": "需于郊，利用恆，無咎。"
   },
   {
    "name": "九二",
    "text": "需于沙，小有言；終吉。"
   },
   {
    "name": "九三",
    "text": "需于泥，致寇至。"
   },
   {
    "name": "六四",
    "text": "需于血，出自穴。"
   },
   {
    "name": "九五",
    "text": "需于酒食，貞吉。"
   },
   {
    "name": "上六",
    "text": "入于穴，有不速之客三人來；敬之，終吉。"
   }
  ]
 },
 {
  "id": 6,
  "name": "訟",
  "fullName": "天水訟",
  "lower": "坎",
  "upper": "乾",
  "lines": [
   0,
   1,
   0,
   1,
   1,
   1
  ],
  "guaci": "有孚，窒惕，中吉；終凶。利見大人，不利涉大川。",
  "yaoci": [
   {
    "name": "初六",
    "text": "不永所事，小有言，終吉。"
   },
   {
    "name": "九二",
    "text": "不克訟，歸而逋，其邑人三百戶，無眚。"
   },
   {
    "name": "六三",
    "text": "食舊德，貞厲，終吉；或從王事，無成。"
   },
   {
    "name": "九四",
    "text": "不克訟；復即命，渝，安貞，吉。"
   },
   {
    "name": "九五",
    "text": "訟，元吉。"
   },
   {
    "name": "上九",
    "text": "或錫之鞶帶，終朝三褫之。"
   }
  ]
 },
 {
  "id": 7,
  "name": "師",
  "fullName": "地水師",
  "lower": "坎",
  "upper": "坤",
  "lines": [
   0,
   1,
   0,
   0,
   0,
   0
  ],
  "guaci": "貞，丈人吉，無咎。",
  "yaoci": [
   {
    "name": "初六",
    "text": "師出以律，否臧凶。"
   },
   {
    "name": "九二",
    "text": "在師中吉，無咎；王三錫命。"
   },
   {
    "name": "六三",
    "text": "師或輿尸，凶。"
   },
   {
    "name": "六四",
    "text": "師左次，無咎。"
   },
   {
    "name": "六五",
    "text": "田有禽，利執言，無咎；長子帥師，弟子輿尸，貞凶。"
   },
   {
    "name": "上六",
    "text": "大君有命，開國承家，小人勿用。"
   }
  ]
 },
 {
  "id": 8,
  "name": "比",
  "fullName": "水地比",
  "lower": "坤",
  "upper": "坎",
  "lines": [
   0,
   0,
   0,
   0,
   1,
   0
  ],
  "guaci": "吉。原筮，元永貞，無咎。不寧方來，後夫凶。",
  "yaoci": [
   {
    "name": "初六",
    "text": "有孚比之，無咎；有孚盈缶，終來有它，吉。"
   },
   {
    "name": "六二",
    "text": "比之自內，貞吉。"
   },
   {
    "name": "六三",
    "text": "比之匪人。"
   },
   {
    "name": "六四",
    "text": "外比之，貞吉。"
   },
   {
    "name": "九五",
    "text": "顯比；王用三驅，失前禽。邑人不誡，吉。"
   },
   {
    "name": "上六",
    "text": "比之無首，凶。"
   }
  ]
 },
 {
  "id": 9,
  "name": "小畜",
  "fullName": "風天小畜",
  "lower": "乾",
  "upper": "巽",
  "lines": [
   1,
   1,
   1,
   0,
   1,
   1
  ],
  "guaci": "亨。密雲不雨，自我西郊。",
  "yaoci": [
   {
    "name": "初九",
    "text": "復自道，何其咎？吉。"
   },
   {
    "name": "九二",
    "text": "牽復，吉。"
   },
   {
    "name": "九三",
    "text": "輿說輻，夫妻反目。"
   },
   {
    "name": "六四",
    "text": "有孚，血去惕出，無咎。"
   },
   {
    "name": "九五",
    "text": "有孚攣如，富以其鄰。"
   },
   {
    "name": "上九",
    "text": "既雨既處，尚德載；婦貞厲，月幾望；君子征凶。"
   }
  ]
 },
 {
  "id": 10,
  "name": "履",
  "fullName": "天澤履",
  "lower": "兌",
  "upper": "乾",
  "lines": [
   1,
   1,
   0,
   1,
   1,
   1
  ],
  "guaci": "履虎尾，不咥人，亨。",
  "yaoci": [
   {
    "name": "初九",
    "text": "素履，往，無咎。"
   },
   {
    "name": "九二",
    "text": "履道坦坦，幽人貞吉。"
   },
   {
    "name": "六三",
    "text": "眇能視，跛能履，履虎尾，咥人，凶；武人為于大君。"
   },
   {
    "name": "九四",
    "text": "履虎尾，愬愬，終吉。"
   },
   {
    "name": "九五",
    "text": "夬履，貞厲。"
   },
   {
    "name": "上九",
    "text": "視履考祥，其旋元吉。"
   }
  ]
 },
 {
  "id": 11,
  "name": "泰",
  "fullName": "地天泰",
  "lower": "乾",
  "upper": "坤",
  "lines": [
   1,
   1,
   1,
   0,
   0,
   0
  ],
  "guaci": "小往大來，吉，亨。",
  "yaoci": [
   {
    "name": "初九",
    "text": "拔茅茹，以其匯，征吉。"
   },
   {
    "name": "九二",
    "text": "包荒，用馮河，不遐遺；朋亡，得尚于中行。"
   },
   {
    "name": "九三",
    "text": "無平不陂，無往不復；艱貞無咎，勿恤其孚，于食有福。"
   },
   {
    "name": "六四",
    "text": "翩翩，不富，以其鄰，不戒以孚。"
   },
   {
    "name": "六五",
    "text": "帝乙歸妹，以祉元吉。"
   },
   {
    "name": "上六",
    "text": "城復于隍，勿用師，自邑告命，貞吝。"
   }
  ]
 },
 {
  "id": 12,
  "name": "否",
  "fullName": "天地否",
  "lower": "坤",
  "upper": "乾",
  "lines": [
   0,
   0,
   0,
   1,
   1,
   1
  ],
  "guaci": "否之匪人，不利君子貞，大往小來。",
  "yaoci": [
   {
    "name": "初六",
    "text": "拔茅茹，以其匯，貞吉，亨。"
   },
   {
    "name": "六二",
    "text": "包承，小人吉。大人否，亨。"
   },
   {
    "name": "六三",
    "text": "包羞。"
   },
   {
    "name": "九四",
    "text": "有命無咎，疇離祉。"
   },
   {
    "name": "九五",
    "text": "休否，大人吉；其亡其亡，繫于苞桑。"
   },
   {
    "name": "上九",
    "text": "傾否，先否後喜。"
   }
  ]
 },
 {
  "id": 13,
  "name": "同人",
  "fullName": "天火同人",
  "lower": "離",
  "upper": "乾",
  "lines": [
   1,
   0,
   1,
   1,
   1,
   1
  ],
  "guaci": "同人于野，亨。利涉大川，利君子貞。",
  "yaoci": [
   {
    "name": "初九",
    "text": "同人于門，無咎。"
   },
   {
    "name": "六二",
    "text": "同人于宗，吝。"
   },
   {
    "name": "九三",
    "text": "伏戎于莽，升其高陵，三歲不興。"
   },
   {
    "name": "九四",
    "text": "乘其墉，弗克攻，吉。"
   },
   {
    "name": "九五",
    "text": "同人，先號咷，而後笑，大師克相遇。"
   },
   {
    "name": "上九",
    "text": "同人于郊，無悔。"
   }
  ]
 },
 {
  "id": 14,
  "name": "大有",
  "fullName": "火天大有",
  "lower": "乾",
  "upper": "離",
  "lines": [
   1,
   1,
   1,
   1,
   0,
   1
  ],
  "guaci": "元亨。",
  "yaoci": [
   {
    "name": "初九",
    "text": "無交害，匪咎；艱則無咎。"
   },
   {
    "name": "九二",
    "text": "大車以載，有攸往，無咎。"
   },
   {
    "name": "九三",
    "text": "公用亨于天子，小人弗克。"
   },
   {
    "name": "九四",
    "text": "匪其彭，無咎。"
   },
   {
    "name": "六五",
    "text": "厥孚交如，威如，吉。"
   },
   {
    "name": "上九",
    "text": "自天祐之，吉無不利。"
   }
  ]
 },
 {
  "id": 15,
  "name": "謙",
  "fullName": "地山謙",
  "lower": "艮",
  "upper": "坤",
  "lines": [
   0,
   0,
   1,
   0,
   0,
   0
  ],
  "guaci": "亨，君子有終。",
  "yaoci": [
   {
    "name": "初六",
    "text": "謙謙君子，用涉大川，吉。"
   },
   {
    "name": "六二",
    "text": "鳴謙，貞吉。"
   },
   {
    "name": "九三",
    "text": "勞謙，君子有終，吉。"
   },
   {
    "name": "六四",
    "text": "無不利，撝謙。"
   },
   {
    "name": "六五",
    "text": "不富以其鄰，利用侵伐，無不利。"
   },
   {
    "name": "上六",
    "text": "鳴謙，利用行師，征邑國。"
   }
  ]
 },
 {
  "id": 16,
  "name": "豫",
  "fullName": "雷地豫",
  "lower": "坤",
  "upper": "震",
  "lines": [
   0,
   0,
   0,
   1,
   0,
   0
  ],
  "guaci": "利建侯，行師。",
  "yaoci": [
   {
    "name": "初六",
    "text": "鳴豫，凶。"
   },
   {
    "name": "六二",
    "text": "介于石，不終日，貞吉。"
   },
   {
    "name": "六三",
    "text": "盱豫，悔。遲有悔。"
   },
   {
    "name": "九四",
    "text": "由豫，大有得；勿疑。朋盍簪。"
   },
   {
    "name": "六五",
    "text": "貞疾，恆不死。"
   },
   {
    "name": "上六",
    "text": "冥豫，成有渝，無咎。"
   }
  ]
 },
 {
  "id": 17,
  "name": "隨",
  "fullName": "澤雷隨",
  "lower": "震",
  "upper": "兌",
  "lines": [
   1,
   0,
   0,
   1,
   1,
   0
  ],
  "guaci": "元亨，利貞，無咎。",
  "yaoci": [
   {
    "name": "初九",
    "text": "官有渝，貞吉；出門交有功。"
   },
   {
    "name": "六二",
    "text": "系小子，失丈夫。"
   },
   {
    "name": "六三",
    "text": "系丈夫，失小子；隨有求得，利居貞。"
   },
   {
    "name": "九四",
    "text": "隨有獲，貞凶；有孚在道，以明，何咎？"
   },
   {
    "name": "九五",
    "text": "孚于嘉，吉。"
   },
   {
    "name": "上六",
    "text": "拘繫之，乃從維之；王用亨于西山。"
   }
  ]
 },
 {
  "id": 18,
  "name": "蠱",
  "fullName": "山風蠱",
  "lower": "巽",
  "upper": "艮",
  "lines": [
   0,
   1,
   1,
   0,
   0,
   1
  ],
  "guaci": "元亨，利涉大川。先甲三日，後甲三日。",
  "yaoci": [
   {
    "name": "初六",
    "text": "幹父之蠱，有子，考無咎，厲終吉。"
   },
   {
    "name": "九二",
    "text": "幹母之蠱，不可貞。"
   },
   {
    "name": "九三",
    "text": "幹父之蠱，小有悔，無大咎。"
   },
   {
    "name": "六四",
    "text": "裕父之蠱，往見吝。"
   },
   {
    "name": "六五",
    "text": "幹父之蠱，用譽。"
   },
   {
    "name": "上九",
    "text": "不事王侯，高尚其事。"
   }
  ]
 },
 {
  "id": 19,
  "name": "臨",
  "fullName": "地澤臨",
  "lower": "兌",
  "upper": "坤",
  "lines": [
   1,
   1,
   0,
   0,
   0,
   0
  ],
  "guaci": "元亨，利貞；至于八月，有凶。",
  "yaoci": [
   {
    "name": "初九",
    "text": "咸臨，貞吉。"
   },
   {
    "name": "九二",
    "text": "咸臨，吉，無不利。"
   },
   {
    "name": "六三",
    "text": "甘臨，無攸利；既憂之，無咎。"
   },
   {
    "name": "六四",
    "text": "至臨，無咎。"
   },
   {
    "name": "六五",
    "text": "知臨，大君之宜，吉。"
   },
   {
    "name": "上六",
    "text": "敦臨，吉，無咎。"
   }
  ]
 },
 {
  "id": 20,
  "name": "觀",
  "fullName": "風地觀",
  "lower": "坤",
  "upper": "巽",
  "lines": [
   0,
   0,
   0,
   0,
   1,
   1
  ],
  "guaci": "盥而不薦，有孚顒若。",
  "yaoci": [
   {
    "name": "初六",
    "text": "童觀，小人無咎，君子吝。"
   },
   {
    "name": "六二",
    "text": "窺觀，利女貞。"
   },
   {
    "name": "六三",
    "text": "觀我生，進退。"
   },
   {
    "name": "六四",
    "text": "觀國之光，利用賓于王。"
   },
   {
    "name": "九五",
    "text": "觀我生，君子無咎。"
   },
   {
    "name": "上九",
    "text": "觀其生，君子無咎。"
   }
  ]
 },
 {
  "id": 21,
  "name": "噬嗑",
  "fullName": "火雷噬嗑",
  "lower": "震",
  "upper": "離",
  "lines": [
   1,
   0,
   0,
   1,
   0,
   1
  ],
  "guaci": "亨，利用獄。",
  "yaoci": [
   {
    "name": "初九",
    "text": "屨校滅趾，無咎。"
   },
   {
    "name": "六二",
    "text": "噬膚滅鼻，無咎。"
   },
   {
    "name": "六三",
    "text": "噬臘肉，遇毒；小吝，無咎。"
   },
   {
    "name": "九四",
    "text": "噬幹胏，得金矢；利艱貞，吉。"
   },
   {
    "name": "六五",
    "text": "噬乾肉，得黃金，貞厲，無咎。"
   },
   {
    "name": "上九",
    "text": "何校滅耳，凶。"
   }
  ]
 },
 {
  "id": 22,
  "name": "賁",
  "fullName": "山火賁",
  "lower": "離",
  "upper": "艮",
  "lines": [
   1,
   0,
   1,
   0,
   0,
   1
  ],
  "guaci": "亨，小利有攸往。",
  "yaoci": [
   {
    "name": "初九",
    "text": "賁其趾，舍車而徒。"
   },
   {
    "name": "六二",
    "text": "賁其須。"
   },
   {
    "name": "九三",
    "text": "賁如，濡如，永貞吉。"
   },
   {
    "name": "六四",
    "text": "賁如，皤如，白馬翰如，匪寇，婚媾。"
   },
   {
    "name": "六五",
    "text": "賁于丘園，束帛戔戔；吝，終吉。"
   },
   {
    "name": "上九",
    "text": "白賁，無咎。"
   }
  ]
 },
 {
  "id": 23,
  "name": "剝",
  "fullName": "山地剝",
  "lower": "坤",
  "upper": "艮",
  "lines": [
   0,
   0,
   0,
   0,
   0,
   1
  ],
  "guaci": "不利有攸往。",
  "yaoci": [
   {
    "name": "初六",
    "text": "剝床以足，蔑貞；凶。"
   },
   {
    "name": "六二",
    "text": "剝床以辨，蔑貞凶。"
   },
   {
    "name": "六三",
    "text": "剝之，無咎。"
   },
   {
    "name": "六四",
    "text": "剝床以膚，凶。"
   },
   {
    "name": "六五",
    "text": "貫魚以宮人寵，無不利。"
   },
   {
    "name": "上九",
    "text": "碩果不食，君子得輿，小人剝廬。"
   }
  ]
 },
 {
  "id": 24,
  "name": "復",
  "fullName": "地雷復",
  "lower": "震",
  "upper": "坤",
  "lines": [
   1,
   0,
   0,
   0,
   0,
   0
  ],
  "guaci": "亨。出入無疾，朋來無咎。反覆其道，七日來復，利有攸往。",
  "yaoci": [
   {
    "name": "初九",
    "text": "不遠復，無祗悔，元吉。"
   },
   {
    "name": "六二",
    "text": "休復，吉。"
   },
   {
    "name": "六三",
    "text": "頻復，厲無咎。"
   },
   {
    "name": "六四",
    "text": "中行獨復。"
   },
   {
    "name": "六五",
    "text": "敦復，無悔。"
   },
   {
    "name": "上六",
    "text": "迷復，凶，有災眚。用行師，終有大敗；以其國，君凶，至于十年不克征。"
   }
  ]
 },
 {
  "id": 25,
  "name": "無妄",
  "fullName": "天雷無妄",
  "lower": "震",
  "upper": "乾",
  "lines": [
   1,
   0,
   0,
   1,
   1,
   1
  ],
  "guaci": "元亨利貞。其匪正有眚，不利有攸往。",
  "yaoci": [
   {
    "name": "初九",
    "text": "無妄，往吉。"
   },
   {
    "name": "六二",
    "text": "不耕穫，不菑畬，則利有攸往。"
   },
   {
    "name": "六三",
    "text": "無妄之災：或繫之牛，行人之得，邑人之災。"
   },
   {
    "name": "九四",
    "text": "可貞，無咎。"
   },
   {
    "name": "九五",
    "text": "無妄之疾，勿藥有喜。"
   },
   {
    "name": "上九",
    "text": "無妄，行有眚，無攸利。"
   }
  ]
 },
 {
  "id": 26,
  "name": "大畜",
  "fullName": "山天大畜",
  "lower": "乾",
  "upper": "艮",
  "lines": [
   1,
   1,
   1,
   0,
   0,
   1
  ],
  "guaci": "利貞，不家食，吉；利涉大川。",
  "yaoci": [
   {
    "name": "初九",
    "text": "有厲，利已。"
   },
   {
    "name": "九二",
    "text": "輿說輹。"
   },
   {
    "name": "九三",
    "text": "良馬逐，利艱貞。曰閑輿衛，利有攸往。"
   },
   {
    "name": "六四",
    "text": "童牛之牿，元吉。"
   },
   {
    "name": "六五",
    "text": "豶豕之牙，吉。"
   },
   {
    "name": "上九",
    "text": "何天之衢，亨。"
   }
  ]
 },
 {
  "id": 27,
  "name": "頤",
  "fullName": "山雷頤",
  "lower": "震",
  "upper": "艮",
  "lines": [
   1,
   0,
   0,
   0,
   0,
   1
  ],
  "guaci": "貞吉，觀頤，自求口實。",
  "yaoci": [
   {
    "name": "初九",
    "text": "舍爾靈龜，觀我朵頤，凶。"
   },
   {
    "name": "六二",
    "text": "顛頤；拂經于丘頤，征凶。"
   },
   {
    "name": "六三",
    "text": "拂頤；貞凶，十年勿用；無攸利。"
   },
   {
    "name": "六四",
    "text": "顛頤，吉；虎視眈眈，其欲逐逐，無咎。"
   },
   {
    "name": "六五",
    "text": "拂經；居貞吉，不可涉大川。"
   },
   {
    "name": "上九",
    "text": "由頤；厲吉，利涉大川。"
   }
  ]
 },
 {
  "id": 28,
  "name": "大過",
  "fullName": "澤風大過",
  "lower": "巽",
  "upper": "兌",
  "lines": [
   0,
   1,
   1,
   1,
   1,
   0
  ],
  "guaci": "棟橈；利有攸往，亨。",
  "yaoci": [
   {
    "name": "初六",
    "text": "藉用白茅，無咎。"
   },
   {
    "name": "九二",
    "text": "枯楊生稊，老夫得其女妻；無不利。"
   },
   {
    "name": "九三",
    "text": "棟橈，凶。"
   },
   {
    "name": "九四",
    "text": "棟隆，吉；有它，吝。"
   },
   {
    "name": "九五",
    "text": "枯楊生華，老婦得其士夫，無咎無譽。"
   },
   {
    "name": "上六",
    "text": "過涉滅頂；凶，無咎。"
   }
  ]
 },
 {
  "id": 29,
  "name": "坎",
  "fullName": "坎為水",
  "lower": "坎",
  "upper": "坎",
  "lines": [
   0,
   1,
   0,
   0,
   1,
   0
  ],
  "guaci": "有孚，維心亨。行有尚。",
  "yaoci": [
   {
    "name": "初六",
    "text": "習坎，入于坎窞，凶。"
   },
   {
    "name": "九二",
    "text": "坎有險，求小得。"
   },
   {
    "name": "六三",
    "text": "來之坎坎，險且枕，入于坎窞，勿用。"
   },
   {
    "name": "六四",
    "text": "樽酒，簋貳，用缶，納約自牖，終無咎。"
   },
   {
    "name": "九五",
    "text": "坎不盈，祗既平，無咎。"
   },
   {
    "name": "上六",
    "text": "係用徽纆，寘于叢棘，三歲不得，凶。"
   }
  ]
 },
 {
  "id": 30,
  "name": "離",
  "fullName": "離為火",
  "lower": "離",
  "upper": "離",
  "lines": [
   1,
   0,
   1,
   1,
   0,
   1
  ],
  "guaci": "利貞，亨。畜牝牛，吉。",
  "yaoci": [
   {
    "name": "初九",
    "text": "履錯然，敬之，無咎。"
   },
   {
    "name": "六二",
    "text": "黃離，元吉。"
   },
   {
    "name": "九三",
    "text": "日昃之離，不鼓缶而歌，則大耋之嗟，凶。"
   },
   {
    "name": "九四",
    "text": "突如其來如，焚如，死如，棄如。"
   },
   {
    "name": "六五",
    "text": "出涕沱若，戚嗟若，吉。"
   },
   {
    "name": "上九",
    "text": "王用出征，有嘉折首，獲匪其醜，無咎。"
   }
  ]
 },
 {
  "id": 31,
  "name": "咸",
  "fullName": "澤山咸",
  "lower": "艮",
  "upper": "兌",
  "lines": [
   0,
   0,
   1,
   1,
   1,
   0
  ],
  "guaci": "亨，利貞。取女吉。",
  "yaoci": [
   {
    "name": "初六",
    "text": "咸其拇。"
   },
   {
    "name": "六二",
    "text": "咸其腓，凶；居吉。"
   },
   {
    "name": "九三",
    "text": "咸其股，執其隨，往吝。"
   },
   {
    "name": "九四",
    "text": "貞吉，悔亡，憧憧往來，朋從爾思。"
   },
   {
    "name": "九五",
    "text": "咸其脢，無悔。"
   },
   {
    "name": "上六",
    "text": "咸其輔頰舌。"
   }
  ]
 },
 {
  "id": 32,
  "name": "恆",
  "fullName": "雷風恆",
  "lower": "巽",
  "upper": "震",
  "lines": [
   0,
   1,
   1,
   1,
   0,
   0
  ],
  "guaci": "亨，無咎，利貞，利有攸往。",
  "yaoci": [
   {
    "name": "初六",
    "text": "浚恆，貞凶，無攸利。"
   },
   {
    "name": "九二",
    "text": "悔亡。"
   },
   {
    "name": "九三",
    "text": "不恆其德，或承之羞；貞吝。"
   },
   {
    "name": "九四",
    "text": "田無禽。"
   },
   {
    "name": "六五",
    "text": "恆其德，貞；婦人吉，夫子凶。"
   },
   {
    "name": "上六",
    "text": "振恆，凶。"
   }
  ]
 },
 {
  "id": 33,
  "name": "遯",
  "fullName": "天山遯",
  "lower": "艮",
  "upper": "乾",
  "lines": [
   0,
   0,
   1,
   1,
   1,
   1
  ],
  "guaci": "亨，小利貞。",
  "yaoci": [
   {
    "name": "初六",
    "text": "遯尾，厲，勿用有攸往。"
   },
   {
    "name": "六二",
    "text": "執之用黃牛之革，莫之勝說。"
   },
   {
    "name": "九三",
    "text": "系遯，有疾厲；畜臣妾，吉。"
   },
   {
    "name": "九四",
    "text": "好遯，君子吉，小人否。"
   },
   {
    "name": "九五",
    "text": "嘉遯，貞吉。"
   },
   {
    "name": "上九",
    "text": "肥遯，無不利。"
   }
  ]
 },
 {
  "id": 34,
  "name": "大壯",
  "fullName": "雷天大壯",
  "lower": "乾",
  "upper": "震",
  "lines": [
   1,
   1,
   1,
   1,
   0,
   0
  ],
  "guaci": "利貞。",
  "yaoci": [
   {
    "name": "初九",
    "text": "壯于趾，征凶，有孚。"
   },
   {
    "name": "九二",
    "text": "貞吉。"
   },
   {
    "name": "九三",
    "text": "小人用壯，君子用罔；貞厲。羝羊觸藩，羸其角。"
   },
   {
    "name": "九四",
    "text": "貞吉，悔亡；藩決不羸，壯于大輿之輹。"
   },
   {
    "name": "六五",
    "text": "喪羊于易，無悔。"
   },
   {
    "name": "上六",
    "text": "羝羊觸藩，不能退，不能遂，無攸利；艱則吉。"
   }
  ]
 },
 {
  "id": 35,
  "name": "晉",
  "fullName": "火地晉",
  "lower": "坤",
  "upper": "離",
  "lines": [
   0,
   0,
   0,
   1,
   0,
   1
  ],
  "guaci": "康侯用錫馬蕃庶，晝日三接。",
  "yaoci": [
   {
    "name": "初六",
    "text": "晉如摧如，貞吉。罔孚，裕無咎。"
   },
   {
    "name": "六二",
    "text": "晉如愁如，貞吉，受茲介福，于其王母。"
   },
   {
    "name": "六三",
    "text": "眾允，悔亡。"
   },
   {
    "name": "九四",
    "text": "晉如鼫鼠，貞厲。"
   },
   {
    "name": "六五",
    "text": "悔亡，失得勿恤，往吉，無不利。"
   },
   {
    "name": "上九",
    "text": "晉其角，維用伐邑，厲吉無咎。貞吝。"
   }
  ]
 },
 {
  "id": 36,
  "name": "明夷",
  "fullName": "地火明夷",
  "lower": "離",
  "upper": "坤",
  "lines": [
   1,
   0,
   1,
   0,
   0,
   0
  ],
  "guaci": "利艱貞。",
  "yaoci": [
   {
    "name": "初九",
    "text": "明夷于飛，垂其翼；君子于行，三日不食。有攸往，主人有言。"
   },
   {
    "name": "六二",
    "text": "明夷，夷于左股，用拯馬壯，吉。"
   },
   {
    "name": "九三",
    "text": "明夷于南狩，得其大首。不可疾貞。"
   },
   {
    "name": "六四",
    "text": "入于左腹，獲明夷之心，于出門庭。"
   },
   {
    "name": "六五",
    "text": "箕子之明夷，利貞。"
   },
   {
    "name": "上六",
    "text": "不明晦，初登于天，後入于地。"
   }
  ]
 },
 {
  "id": 37,
  "name": "家人",
  "fullName": "風火家人",
  "lower": "離",
  "upper": "巽",
  "lines": [
   1,
   0,
   1,
   0,
   1,
   1
  ],
  "guaci": "利女貞。",
  "yaoci": [
   {
    "name": "初九",
    "text": "閑有家，悔亡。"
   },
   {
    "name": "六二",
    "text": "無攸遂，在中饋，貞吉。"
   },
   {
    "name": "九三",
    "text": "家人嗃嗃，悔厲，吉；婦子嘻嘻，終吝。"
   },
   {
    "name": "六四",
    "text": "富家，大吉。"
   },
   {
    "name": "九五",
    "text": "王假有家，勿恤，吉。"
   },
   {
    "name": "上九",
    "text": "有孚，威如，終吉。"
   }
  ]
 },
 {
  "id": 38,
  "name": "睽",
  "fullName": "火澤睽",
  "lower": "兌",
  "upper": "離",
  "lines": [
   1,
   1,
   0,
   1,
   0,
   1
  ],
  "guaci": "小事吉。",
  "yaoci": [
   {
    "name": "初九",
    "text": "悔亡；喪馬勿逐，自復；見惡人，無咎。"
   },
   {
    "name": "九二",
    "text": "遇主于巷，無咎。"
   },
   {
    "name": "六三",
    "text": "見輿曳，其牛掣；其人天且劓。無初有終。"
   },
   {
    "name": "九四",
    "text": "睽孤，遇元夫，交孚，厲無咎。"
   },
   {
    "name": "六五",
    "text": "悔亡，厥宗噬膚，往何咎？"
   },
   {
    "name": "上九",
    "text": "睽孤，見豕負塗，載鬼一車，先張之弧，後說之弧；匪寇婚媾，往遇雨則吉。"
   }
  ]
 },
 {
  "id": 39,
  "name": "蹇",
  "fullName": "水山蹇",
  "lower": "艮",
  "upper": "坎",
  "lines": [
   0,
   0,
   1,
   0,
   1,
   0
  ],
  "guaci": "利西南，不利東北；利見大人，貞吉。",
  "yaoci": [
   {
    "name": "初六",
    "text": "往蹇，來譽。"
   },
   {
    "name": "六二",
    "text": "王臣蹇蹇，匪躬之故。"
   },
   {
    "name": "九三",
    "text": "往蹇，來反。"
   },
   {
    "name": "六四",
    "text": "往蹇，來連。"
   },
   {
    "name": "九五",
    "text": "大蹇，朋來。"
   },
   {
    "name": "上六",
    "text": "往蹇，來碩；吉，利見大人。"
   }
  ]
 },
 {
  "id": 40,
  "name": "解",
  "fullName": "雷水解",
  "lower": "坎",
  "upper": "震",
  "lines": [
   0,
   1,
   0,
   1,
   0,
   0
  ],
  "guaci": "利西南。無所往，其來復吉。有攸往，夙吉。",
  "yaoci": [
   {
    "name": "初六",
    "text": "無咎。"
   },
   {
    "name": "九二",
    "text": "田獲三狐，得黃矢；貞吉。"
   },
   {
    "name": "六三",
    "text": "負且乘，致寇至，貞吝。"
   },
   {
    "name": "九四",
    "text": "解而拇，朋至斯孚。"
   },
   {
    "name": "六五",
    "text": "君子維有解，吉，有孚于小人。"
   },
   {
    "name": "上六",
    "text": "公用射隼于高墉之上，獲之，無不利。"
   }
  ]
 },
 {
  "id": 41,
  "name": "損",
  "fullName": "山澤損",
  "lower": "兌",
  "upper": "艮",
  "lines": [
   1,
   1,
   0,
   0,
   0,
   1
  ],
  "guaci": "有孚，元吉，無咎，可貞，利有攸往。曷之用？二簋可用享。",
  "yaoci": [
   {
    "name": "初九",
    "text": "已事遄往，無咎；酌損之。"
   },
   {
    "name": "九二",
    "text": "利貞，征凶；弗損益之。"
   },
   {
    "name": "六三",
    "text": "三人行，則損一人；一人行，則得其友。"
   },
   {
    "name": "六四",
    "text": "損其疾，使遄有喜，無咎。"
   },
   {
    "name": "六五",
    "text": "或益之十朋之龜，弗克違，元吉。"
   },
   {
    "name": "上九",
    "text": "弗損益之，無咎。貞吉，利有攸往，得臣無家。"
   }
  ]
 },
 {
  "id": 42,
  "name": "益",
  "fullName": "風雷益",
  "lower": "震",
  "upper": "巽",
  "lines": [
   1,
   0,
   0,
   0,
   1,
   1
  ],
  "guaci": "利有攸往，利涉大川。",
  "yaoci": [
   {
    "name": "初九",
    "text": "利用為大作，元吉，無咎。"
   },
   {
    "name": "六二",
    "text": "或益之十朋之龜，弗克違。永貞吉；王用享于帝，吉。"
   },
   {
    "name": "六三",
    "text": "益之用凶事，無咎；有孚中行，告公用圭。"
   },
   {
    "name": "六四",
    "text": "中行，告公從，利用為依遷國。"
   },
   {
    "name": "九五",
    "text": "有孚惠心，勿問元吉。有孚惠我德。"
   },
   {
    "name": "上九",
    "text": "莫益之，或擊之，立心勿恆，凶。"
   }
  ]
 },
 {
  "id": 43,
  "name": "夬",
  "fullName": "澤天夬",
  "lower": "乾",
  "upper": "兌",
  "lines": [
   1,
   1,
   1,
   1,
   1,
   0
  ],
  "guaci": "揚于王庭，孚號有厲；告自邑，不利即戎，利有攸往。",
  "yaoci": [
   {
    "name": "初九",
    "text": "壯于前趾，往不勝為咎。"
   },
   {
    "name": "九二",
    "text": "惕號，莫夜有戎，勿恤。"
   },
   {
    "name": "九三",
    "text": "壯于頄，有凶。君子夬夬獨行，遇雨若濡，有慍無咎。"
   },
   {
    "name": "九四",
    "text": "臀無膚，其行次且；牽羊悔亡，聞言不信。"
   },
   {
    "name": "九五",
    "text": "莧陸夬夬，中行無咎。"
   },
   {
    "name": "上六",
    "text": "無號，終有凶。"
   }
  ]
 },
 {
  "id": 44,
  "name": "姤",
  "fullName": "天風姤",
  "lower": "巽",
  "upper": "乾",
  "lines": [
   0,
   1,
   1,
   1,
   1,
   1
  ],
  "guaci": "女壯，勿用取女。",
  "yaoci": [
   {
    "name": "初六",
    "text": "繫于金柅，貞吉；有攸往，見凶，羸豕孚躑躅。"
   },
   {
    "name": "九二",
    "text": "包有魚，無咎，不利賓。"
   },
   {
    "name": "九三",
    "text": "臀無膚，其行次且；厲，無大咎。"
   },
   {
    "name": "九四",
    "text": "包無魚，起凶。"
   },
   {
    "name": "九五",
    "text": "以杞包瓜，含章，有隕自天。"
   },
   {
    "name": "上九",
    "text": "姤其角，吝，無咎。"
   }
  ]
 },
 {
  "id": 45,
  "name": "萃",
  "fullName": "澤地萃",
  "lower": "坤",
  "upper": "兌",
  "lines": [
   0,
   0,
   0,
   1,
   1,
   0
  ],
  "guaci": "亨，王假有廟，利見大人，亨，利貞；用大牲吉，利有攸往。",
  "yaoci": [
   {
    "name": "初六",
    "text": "有孚不終，乃亂乃萃；若號，一握為笑，勿恤，往無咎。"
   },
   {
    "name": "六二",
    "text": "引吉，無咎；孚乃利用禴。"
   },
   {
    "name": "六三",
    "text": "萃如，嗟如，無攸利；往無咎，小吝。"
   },
   {
    "name": "九四",
    "text": "大吉，無咎。"
   },
   {
    "name": "九五",
    "text": "萃有位，無咎；匪孚，元永貞，悔亡。"
   },
   {
    "name": "上六",
    "text": "齎諮涕洟，無咎。"
   }
  ]
 },
 {
  "id": 46,
  "name": "升",
  "fullName": "地風升",
  "lower": "巽",
  "upper": "坤",
  "lines": [
   0,
   1,
   1,
   0,
   0,
   0
  ],
  "guaci": "元亨，用見大人，勿恤。南征吉。",
  "yaoci": [
   {
    "name": "初六",
    "text": "允升，大吉。"
   },
   {
    "name": "九二",
    "text": "孚乃利用禴，無咎。"
   },
   {
    "name": "九三",
    "text": "升虛邑。"
   },
   {
    "name": "六四",
    "text": "王用亨于岐山，吉無咎。"
   },
   {
    "name": "六五",
    "text": "貞吉，升階。"
   },
   {
    "name": "上六",
    "text": "冥升，利于不息之貞。"
   }
  ]
 },
 {
  "id": 47,
  "name": "困",
  "fullName": "澤水困",
  "lower": "坎",
  "upper": "兌",
  "lines": [
   0,
   1,
   0,
   1,
   1,
   0
  ],
  "guaci": "亨。貞，大人吉，無咎；有言不信。",
  "yaoci": [
   {
    "name": "初六",
    "text": "臀困于株木，入于幽谷，三歲不覿。"
   },
   {
    "name": "九二",
    "text": "困于酒食，朱紱方來，利用享祀；征凶，無咎。"
   },
   {
    "name": "六三",
    "text": "困于石，據于蒺藜，入于其宮，不見其妻，凶。"
   },
   {
    "name": "九四",
    "text": "來徐徐，困于金車，吝，有終。"
   },
   {
    "name": "九五",
    "text": "劓刖，困于赤紱，乃徐有說，利用祭祀。"
   },
   {
    "name": "上六",
    "text": "困于葛藟，于臲卼，曰動悔，有悔。征吉。"
   }
  ]
 },
 {
  "id": 48,
  "name": "井",
  "fullName": "水風井",
  "lower": "巽",
  "upper": "坎",
  "lines": [
   0,
   1,
   1,
   0,
   1,
   0
  ],
  "guaci": "改邑不改井，無喪無得，往來井井；汔至，亦未繘井，羸其瓶，凶。",
  "yaoci": [
   {
    "name": "初六",
    "text": "井泥不食，舊井無禽。"
   },
   {
    "name": "九二",
    "text": "井谷射鮒，甕敝漏。"
   },
   {
    "name": "九三",
    "text": "井渫不食，為我心惻；可用汲，王明，並受其福。"
   },
   {
    "name": "六四",
    "text": "井甃，無咎。"
   },
   {
    "name": "九五",
    "text": "井冽，寒泉食。"
   },
   {
    "name": "上六",
    "text": "井收勿幕，有孚元吉。"
   }
  ]
 },
 {
  "id": 49,
  "name": "革",
  "fullName": "澤火革",
  "lower": "離",
  "upper": "兌",
  "lines": [
   1,
   0,
   1,
   1,
   1,
   0
  ],
  "guaci": "巳日乃孚，元亨利貞，悔亡。",
  "yaoci": [
   {
    "name": "初九",
    "text": "鞏用黃牛之革。"
   },
   {
    "name": "六二",
    "text": "巳日乃革之，征吉，無咎。"
   },
   {
    "name": "九三",
    "text": "征凶，貞厲；革言三就，有孚。"
   },
   {
    "name": "九四",
    "text": "悔亡，有孚改命，吉。"
   },
   {
    "name": "九五",
    "text": "大人虎變，未佔有孚。"
   },
   {
    "name": "上六",
    "text": "君子豹變，小人革面；征凶，居貞吉。"
   }
  ]
 },
 {
  "id": 50,
  "name": "鼎",
  "fullName": "火風鼎",
  "lower": "巽",
  "upper": "離",
  "lines": [
   0,
   1,
   1,
   1,
   0,
   1
  ],
  "guaci": "元吉，亨。",
  "yaoci": [
   {
    "name": "初六",
    "text": "鼎顛趾，利出否；得妾以其子，無咎。"
   },
   {
    "name": "九二",
    "text": "鼎有實，我仇有疾，不我能即，吉。"
   },
   {
    "name": "九三",
    "text": "鼎耳革，其行塞。雉膏不食；方雨虧悔，終吉。"
   },
   {
    "name": "九四",
    "text": "鼎折足，覆公餗，其形渥，凶。"
   },
   {
    "name": "六五",
    "text": "鼎黃耳，金鉉，利貞。"
   },
   {
    "name": "上九",
    "text": "鼎玉鉉，大吉，無不利。"
   }
  ]
 },
 {
  "id": 51,
  "name": "震",
  "fullName": "震為雷",
  "lower": "震",
  "upper": "震",
  "lines": [
   1,
   0,
   0,
   1,
   0,
   0
  ],
  "guaci": "亨。震來虩虩，笑言啞啞。震驚百里，不喪匕鬯。",
  "yaoci": [
   {
    "name": "初九",
    "text": "震來虩虩，後笑言啞啞，吉。"
   },
   {
    "name": "六二",
    "text": "震來厲，億喪貝，躋于九陵，勿逐，七日得。"
   },
   {
    "name": "六三",
    "text": "震蘇蘇，震行無眚。"
   },
   {
    "name": "九四",
    "text": "震遂泥。"
   },
   {
    "name": "六五",
    "text": "震往來，厲；億無喪，有事。"
   },
   {
    "name": "上六",
    "text": "震索索，視矍矍，征凶。震不于其躬，于其鄰，無咎。婚媾有言。"
   }
  ]
 },
 {
  "id": 52,
  "name": "艮",
  "fullName": "艮為山",
  "lower": "艮",
  "upper": "艮",
  "lines": [
   0,
   0,
   1,
   0,
   0,
   1
  ],
  "guaci": "艮其背，不獲其身；行其庭，不見其人，無咎。",
  "yaoci": [
   {
    "name": "初六",
    "text": "艮其趾，無咎，利永貞。"
   },
   {
    "name": "六二",
    "text": "艮其腓，不拯其隨，其心不快。"
   },
   {
    "name": "九三",
    "text": "艮其限，列其夤，厲燻心。"
   },
   {
    "name": "六四",
    "text": "艮其身，無咎。"
   },
   {
    "name": "六五",
    "text": "艮其輔，言有序，悔亡。"
   },
   {
    "name": "上九",
    "text": "敦艮，吉。"
   }
  ]
 },
 {
  "id": 53,
  "name": "漸",
  "fullName": "風山漸",
  "lower": "艮",
  "upper": "巽",
  "lines": [
   0,
   0,
   1,
   0,
   1,
   1
  ],
  "guaci": "女歸吉，利貞。",
  "yaoci": [
   {
    "name": "初六",
    "text": "鴻漸于幹；小子厲，有言，無咎。"
   },
   {
    "name": "六二",
    "text": "鴻漸于磐，飲食衎衎，吉。"
   },
   {
    "name": "九三",
    "text": "鴻漸于陸，夫征不復，婦孕不育，凶；利禦寇。"
   },
   {
    "name": "六四",
    "text": "鴻漸于木，或得其桷，無咎。"
   },
   {
    "name": "九五",
    "text": "鴻漸于陵，婦三歲不孕；終莫之勝，吉。"
   },
   {
    "name": "上九",
    "text": "鴻漸于陸，其羽可用為儀，吉。"
   }
  ]
 },
 {
  "id": 54,
  "name": "歸妹",
  "fullName": "雷澤歸妹",
  "lower": "兌",
  "upper": "震",
  "lines": [
   1,
   1,
   0,
   1,
   0,
   0
  ],
  "guaci": "征凶，無攸利。",
  "yaoci": [
   {
    "name": "初九",
    "text": "歸妹以娣，跛能履，征吉。"
   },
   {
    "name": "九二",
    "text": "眇能視，利幽人之貞。"
   },
   {
    "name": "六三",
    "text": "歸妹以須，反歸以娣。"
   },
   {
    "name": "九四",
    "text": "歸妹愆期，遲歸有時。"
   },
   {
    "name": "六五",
    "text": "帝乙歸妹，其君之袂，不如其娣之袂良；月幾望，吉。"
   },
   {
    "name": "上六",
    "text": "女承筐，無實；士刲羊，無血。無攸利。"
   }
  ]
 },
 {
  "id": 55,
  "name": "豐",
  "fullName": "雷火豐",
  "lower": "離",
  "upper": "震",
  "lines": [
   1,
   0,
   1,
   1,
   0,
   0
  ],
  "guaci": "亨，王假之；勿憂，宜日中。",
  "yaoci": [
   {
    "name": "初九",
    "text": "遇其配主，雖旬無咎，往有尚。"
   },
   {
    "name": "六二",
    "text": "豐其蔀，日中見鬥。往得疑疾，有孚發若，吉。"
   },
   {
    "name": "九三",
    "text": "豐其沛，日中見沬；折其右肱，無咎。"
   },
   {
    "name": "九四",
    "text": "豐其蔀，日中見鬥，遇其夷主，吉。"
   },
   {
    "name": "六五",
    "text": "來章，有慶譽，吉。"
   },
   {
    "name": "上六",
    "text": "豐其屋，蔀其家，窺其戶，闃其無人，三歲不覿，凶。"
   }
  ]
 },
 {
  "id": 56,
  "name": "旅",
  "fullName": "火山旅",
  "lower": "艮",
  "upper": "離",
  "lines": [
   0,
   0,
   1,
   1,
   0,
   1
  ],
  "guaci": "小亨，旅貞吉。",
  "yaoci": [
   {
    "name": "初六",
    "text": "旅瑣瑣，斯其所取災。"
   },
   {
    "name": "六二",
    "text": "旅即次，懷其資，得童僕，貞。"
   },
   {
    "name": "九三",
    "text": "旅焚其次，喪其童僕，貞厲。"
   },
   {
    "name": "九四",
    "text": "旅于處，得其資斧，我心不快。"
   },
   {
    "name": "六五",
    "text": "射雉，一矢亡；終以譽命。"
   },
   {
    "name": "上九",
    "text": "鳥焚其巢，旅人先笑後號啕；喪牛于易，凶。"
   }
  ]
 },
 {
  "id": 57,
  "name": "巽",
  "fullName": "巽為風",
  "lower": "巽",
  "upper": "巽",
  "lines": [
   0,
   1,
   1,
   0,
   1,
   1
  ],
  "guaci": "小亨，利有攸往，利見大人。",
  "yaoci": [
   {
    "name": "初六",
    "text": "進退，利武人之貞。"
   },
   {
    "name": "九二",
    "text": "巽在床下，用史巫紛若，吉，無咎。"
   },
   {
    "name": "九三",
    "text": "頻巽，吝。"
   },
   {
    "name": "六四",
    "text": "悔亡，田獲三品。"
   },
   {
    "name": "九五",
    "text": "貞吉，悔亡，無不利。無初有終。先庚三日，後庚三日，吉。"
   },
   {
    "name": "上九",
    "text": "巽在床下，喪其資斧，貞凶。"
   }
  ]
 },
 {
  "id": 58,
  "name": "兌",
  "fullName": "兌為澤",
  "lower": "兌",
  "upper": "兌",
  "lines": [
   1,
   1,
   0,
   1,
   1,
   0
  ],
  "guaci": "亨，利貞。",
  "yaoci": [
   {
    "name": "初九",
    "text": "和兌，吉。"
   },
   {
    "name": "九二",
    "text": "孚兌，吉，悔亡。"
   },
   {
    "name": "六三",
    "text": "來兌，凶。"
   },
   {
    "name": "九四",
    "text": "商兌未寧，介疾有喜。"
   },
   {
    "name": "九五",
    "text": "孚于剝，有厲。"
   },
   {
    "name": "上六",
    "text": "引兌。"
   }
  ]
 },
 {
  "id": 59,
  "name": "渙",
  "fullName": "風水渙",
  "lower": "坎",
  "upper": "巽",
  "lines": [
   0,
   1,
   0,
   0,
   1,
   1
  ],
  "guaci": "亨，王假有廟，利涉大川，利貞。",
  "yaoci": [
   {
    "name": "初六",
    "text": "用拯馬壯，吉。"
   },
   {
    "name": "九二",
    "text": "渙奔其機，悔亡。"
   },
   {
    "name": "六三",
    "text": "渙其躬，無悔。"
   },
   {
    "name": "六四",
    "text": "渙其群，元吉；渙有丘，匪夷所思。"
   },
   {
    "name": "九五",
    "text": "渙汗其大號，渙王居，無咎。"
   },
   {
    "name": "上九",
    "text": "渙其血去逖出，無咎。"
   }
  ]
 },
 {
  "id": 60,
  "name": "節",
  "fullName": "水澤節",
  "lower": "兌",
  "upper": "坎",
  "lines": [
   1,
   1,
   0,
   0,
   1,
   0
  ],
  "guaci": "亨，苦節，不可貞。",
  "yaoci": [
   {
    "name": "初九",
    "text": "不出戶庭，無咎。"
   },
   {
    "name": "九二",
    "text": "不出門庭，凶。"
   },
   {
    "name": "六三",
    "text": "不節若，則嗟若，無咎。"
   },
   {
    "name": "六四",
    "text": "安節，亨。"
   },
   {
    "name": "九五",
    "text": "甘節，吉。往有尚。"
   },
   {
    "name": "上六",
    "text": "苦節，貞凶，悔亡。"
   }
  ]
 },
 {
  "id": 61,
  "name": "中孚",
  "fullName": "風澤中孚",
  "lower": "兌",
  "upper": "巽",
  "lines": [
   1,
   1,
   0,
   0,
   1,
   1
  ],
  "guaci": "豚魚吉，利涉大川，利貞。",
  "yaoci": [
   {
    "name": "初九",
    "text": "虞吉，有他不燕。"
   },
   {
    "name": "九二",
    "text": "鳴鶴在陰，其子和之；我有好爵，吾與爾靡之。"
   },
   {
    "name": "六三",
    "text": "得敵，或鼓或罷，或泣或歌。"
   },
   {
    "name": "六四",
    "text": "月幾望，馬匹亡，無咎。"
   },
   {
    "name": "九五",
    "text": "有孚攣如，無咎。"
   },
   {
    "name": "上九",
    "text": "翰音登于天，貞凶。"
   }
  ]
 },
 {
  "id": 62,
  "name": "小過",
  "fullName": "雷山小過",
  "lower": "艮",
  "upper": "震",
  "lines": [
   0,
   0,
   1,
   1,
   0,
   0
  ],
  "guaci": "亨，利貞；可小事，不可大事；飛鳥遺之音，不宜上，宜下，大吉。",
  "yaoci": [
   {
    "name": "初六",
    "text": "飛鳥以凶。"
   },
   {
    "name": "六二",
    "text": "過其祖，遇其妣；不及其君，遇其臣，無咎。"
   },
   {
    "name": "九三",
    "text": "弗過防之，從或戕之，凶。"
   },
   {
    "name": "九四",
    "text": "無咎，弗過遇之；往厲必戒，勿用永貞。"
   },
   {
    "name": "六五",
    "text": "密雲不雨，自我西郊；公弋取彼在穴。"
   },
   {
    "name": "上六",
    "text": "弗遇過之；飛鳥離之，凶，是謂災眚。"
   }
  ]
 },
 {
  "id": 63,
  "name": "既濟",
  "fullName": "水火既濟",
  "lower": "離",
  "upper": "坎",
  "lines": [
   1,
   0,
   1,
   0,
   1,
   0
  ],
  "guaci": "亨小，利貞。初吉終亂。",
  "yaoci": [
   {
    "name": "初九",
    "text": "曳其輪，濡其尾，無咎。"
   },
   {
    "name": "六二",
    "text": "婦喪其茀，勿逐，七日得。"
   },
   {
    "name": "九三",
    "text": "高宗伐鬼方，三年克之；小人勿用。"
   },
   {
    "name": "六四",
    "text": "繻有衣袽，終日戒。"
   },
   {
    "name": "九五",
    "text": "東鄰殺牛，不如西鄰之禴祭，實受其福。"
   },
   {
    "name": "上六",
    "text": "濡其首，厲。"
   }
  ]
 },
 {
  "id": 64,
  "name": "未濟",
  "fullName": "火水未濟",
  "lower": "坎",
  "upper": "離",
  "lines": [
   0,
   1,
   0,
   1,
   0,
   1
  ],
  "guaci": "亨，小狐汔濟，濡其尾，無攸利。",
  "yaoci": [
   {
    "name": "初六",
    "text": "濡其尾，吝。"
   },
   {
    "name": "九二",
    "text": "曳其輪，貞吉。"
   },
   {
    "name": "六三",
    "text": "未濟，征凶，利涉大川。"
   },
   {
    "name": "九四",
    "text": "貞吉，悔亡；震用伐鬼方，三年有賞于大國。"
   },
   {
    "name": "六五",
    "text": "貞吉，無悔；君子之光，有孚，吉。"
   },
   {
    "name": "上九",
    "text": "有孚于飲酒；無咎，濡其首，有孚失是。"
   }
  ]
 }
];
export const guaByLines = new Map(ZHOUYI.map(g => [g.lines.join(''), g]));
